from settings import *

text_map = [
    '1111211112111121111111',
    '11.....1.........1...1',
    '1..111...1...111...1.1',
    '11...1..1..1...1..11.1',
    '1..1.1..1..1..1....1.1',
    '11.1...1.1...1...1.1.1',
    '1....1.....1...1.....1',
    '1..1...1...1.1...1...1',
    '1..111...1.1.111...1.1',
    '11...1..1..1.1....11.1',
    '1..1.1..11....1.1..1.1',
    '1..1...1.1.1.1...1.1.1',
    '1....1.....1...1.1...1',
    '1121111111112111111111'
]

# Задание карты в текстовом формате и передача информации
map = {}
active_in_map = {}
for j, row in enumerate(text_map):
    for i, char in enumerate(row):
        if char != '.':
            if char == '1':
                map[(i * cube, j * cube)] = '1'
            elif char == '2':
                map[(i * cube, j * cube)] = '2'
                active_in_map[(i * cube, j * cube)] = '2'
