from settings import *

text_map = [
    '0000100001000010000000',
    '00.....0.........0...0',
    '0...00...0...000...0.0',
    '00.0....0..0...0..00.0',
    '0..0....0..0..0.0....0',
    '0.00.0.0.3...0...0.000',
    '0....0.....0...0.....0',
    '0.00...0...0.0...0.0.0',
    '0..000...4.0.000...0.0',
    '00...00.0..0.0....0..0',
    '0..0.0..00....0.0..0.0',
    '00....0.0.0.0.0.....00',
    '0..0...........0.0...0',
    '0010o0d0t0c0p020001000'
]

# Задание карты в текстовом формате и передача информации
map = {}
active_in_map = {}
chars = ['1', '2', '3', '4', '5', 'o', 'd', 't', 'c', 'p']
for j, row in enumerate(text_map):
    for i, char in enumerate(row):
        if char != '.':
            if char == '0':
                map[(i * cube, j * cube)] = '0'
            for k in chars:
                if char == k:
                    map[(i * cube, j * cube)] = k
                    active_in_map[(i * cube, j * cube)] = k
